public class GardenItem {
}
//todo Этап 3: 1 шаг создать класс каталог.Добавляем addCategory and ShowCategory.
//todo Добавляем счетчик в класс Jatalog,будет отвечать за сколько есть категорий. а 2 счетчик будет отвечать за то
//todo сколько есть саб категормий в категории.из каждого класса создаём несколько объектов, надо использовать addCategory
//todo ShowCategory

// 4 этап: Полиморфизм. Нужно в класс продукт добавить абстрактный метод showInfo в класс категории. Надо создавать несколько
// разный товаров в класс продукт в виде аррэй лист, тип данных категории или продукт. То есть мы создаем новые продукты и
// добавляем их в список эрэй лист. В программе создать метод showinfo что то такое чтобы весь список показать на экране,
// если в списке товаров есть 5 товаров то нужно чтобы все 5 товаров были показаны в списке.